# Pandas는 무엇인가요?
* 데이터 분석 및 가공에 사용되는 파이썬 라이브러리.

In [4]:
import pandas as pd

pd.__version__

'1.3.5'

In [14]:
data_frame = pd.read_csv('data/friend_list.csv')
print(data_frame)
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 데이터 프레임(Dataframe)
- 가로축과 세로축이 있는 엑셀과 유사한 데이터 구조
- 가로축은 row(행), 세로축은 column(열)
- 데이터베이스의 테이블 구조

In [12]:
# 데이터프레임이 가지고 있는 함수의 예제
data_frame.head(3) # default :5

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## 시리즈(Series)
- 데이터프레임의 컬럼(열)은 모두 시리즈.
- 단순히 파이썬 리스트를 간직한 오브젝트.
- 리스트를 파라미터로 주면 바로 시리즈가 생성.
- 데이터 가공 및 분석이 파이썬 리스트보다 훨씬 쉽다.

In [15]:
type(data_frame.job)

pandas.core.series.Series

In [19]:
# 시리즈의 함수 예제
data_frame.job = data_frame.job.str.upper()
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

In [20]:
s1 = pd.core.series.Series(['one', 'two','three'])
s2 = pd.core.series.Series([1, 2, 3])

In [21]:
pd.DataFrame(data=dict(word=s1, num=s2))

    word  num
0    one    1
1    two    2
2  three    3

In [22]:
df = pd.read_csv('data/friend_list.txt')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [25]:
# 구분자에 의해 컬럼이 구분되어 있는 데이터는 모두 지원.
df2 = pd.read_csv('data/friend_list_tab.txt', delimiter='\t')
df2.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [37]:
df3 = pd.read_csv('data/friend_list_no_head.csv',header = None)  # 자동으로 header를 지정 0 , 1, 2.....
df3.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

In [35]:
df3 = pd.read_csv('data/friend_list_no_head.csv',header = None, names=['name', 'age', 'job'])  # names == columns 와 동일 기능
df3.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [32]:
df3.columns = ['name', 'age', 'job']   # names == columns 와 동일 기능
df3.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# 데이터프레임을 파이썬 코드로 생성하기

In [39]:
friend_dict_list=[{'name':'Jone', 'age':20, 'job':'student'}, 
                  {'name':'Jenny','age':30, 'job':'developer'}, 
                  {'name':'Nate','age':25, 'job':'teacher'}]

df = pd.DataFrame(friend_dict_list)
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   25    teacher

In [40]:
df = df[['name','age','job']]  # 데이터의 순서가 항상 설정한 대로 출력되지 않기 때문에 따로 지정해주면 원하는 순서로 출력 가능
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   25    teacher

### OrderedDict로 데이터 프레임 생성하기
- OrderdDict 자료구조로 데이터프레임을 생성하면, 컬럼의 순서가 뒤바뀌지 않음.

In [41]:
from collections import OrderedDict

In [48]:
                                friend_orderd_dict = OrderedDict([('name', ['John', 'Jenny','Nate']),
                                ('age', [20,30,25]),
                                ('job', ['student','developer', 'teacher'])])


df4 = pd.DataFrame.from_dict(friend_orderd_dict)  # OrderedDict의 자료형을 DataFrame으로 변경시 from_dict 함수를 사용
df4.tail(2)

    name  age        job
1  Jenny   30  developer
2   Nate   25    teacher

### list로 데이터프레임 생성하기

In [51]:
friend_list = [['John', 20, 'student'],
              ['Jenny', 30, 'developer'],
              ['Nate', 25, 'teacher']]

colunm_name = ['name', 'age', 'job']

df = pd.DataFrame.from_records(friend_list, columns=colunm_name)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   25    teacher

In [52]:
friend_dict ={'name': ['John', 'Jenny','Nate'], 
                    'age' : [20,30,25],
                    'job' : ['student','developer', 'teacher']}

df =pd.DataFrame.from_dict(friend_dict)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   25    teacher

In [53]:
# 파일 저장하기 to_csv()

df.to_csv('data/friend_list_from_df.csv')

In [54]:
df.to_csv('data/friend_list_from_df.txt')

In [55]:
df.to_csv('data/friend_list_from_df_header_index.csv', header=False, index=False) # header index 유무 지정 가능

In [56]:
friend_dict ={'name': ['John', 'Jenny','Nate'], 
                    'age' : [20, None,25],  #NaN : Not a Number
                    'job' : ['student','developer', 'teacher']}

df =pd.DataFrame.from_dict(friend_dict)
df.head()

    name   age        job
0   John  20.0    student
1  Jenny   NaN  developer
2   Nate  25.0    teacher

In [58]:
df.to_csv('data/friend_dict_from_df.csv')  # None 값은 공란으로 저장된다.

In [59]:
df.to_csv('data/friend_dict_from_df_narep.csv', na_rep='-') # 공백을 ' - '로 대체하는 방법 na_rep = ' '

### 데이터 접근 방법
- 인덱스로 row 선택하기

In [72]:
friend_dict ={'name': ['John', 'Jenny','Nate'], 
                    'age' : [20, 30,25],  #NaN : Not a Number
                    'job' : ['student','developer', 'teacher']}

df =pd.DataFrame.from_dict(friend_dict)
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   25    teacher

In [86]:
df[1:3]  # dataframe일 경우 슬라이싱을 하면 row가 지정된다. 직접 접근은 슬라이싱만 가능 / 순차적인 접근

    name  age        job
1  Jenny   30  developer
2   Nate   25    teacher

In [87]:
df[0,2]  # error 행렬의 구분과 혼동될 여지가 있어 지원하지 않는다.

KeyError: (0, 2)

In [108]:
# 순차적이지 않은 row를 선택  list형태로만 접근 가능
df.loc[[0,2]]

# df.loc[1:2, 'age']  # 행은 : 로 지정  ,뒤에 ' '특정 열을 지정해 그 열의 값만 출력 가능

   name  age      job
0  John   20  student
2  Nate   25  teacher

In [93]:
df.loc[0, 2] # error

KeyError: 2

In [104]:
df.loc[[0:2]] # 주의 - loc는 슬라이싱 기능 지원하지 않음

SyntaxError: invalid syntax (1152240759.py, line 1)

   name  age      job
0  John   20  student
2  Nate   25  teacher

### 컬럼값에 따른 row 선택하기
- 마치 데이터베이스에 쿼리를 전달하듯, 특정한 컬럼값을 충족하는 row만 선택.

In [101]:
df_filtered = df[df.age > 25]

df_filtered

    name  age        job
1  Jenny   30  developer

In [103]:
df_query = df.query('age>25')
df_query

    name  age        job
1  Jenny   30  developer

In [110]:
df_filtered = df[(df.age>=25) & (df.name=='Nate')]
df_filtered

   name  age      job
2  Nate   25  teacher

# 컬럼 필터하기
### 인덱스로 필터하기

In [112]:
friend_list=[['John', 20, 'student'],
            ['Jenny', 30, 'developer'],
            ['Nate', 25, 'teacher']]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  25    teacher

In [126]:
# 모든 row를 보여주되, 컬럼은 0부터 1까지만 출력.
df.iloc[:,:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  25

In [127]:
# 모든 row를 보여주되, 컬럼은 0과 2만 출력.
df.iloc[:,[0,2]]

       0          2
0   John    student
1  Jenny  developer
2   Nate    teacher

### 컬럼 이름으로 필터링하기

In [129]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name','age','job']) # pd.read_table()  / default가 , 와 tab으로 구분
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [139]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [137]:
df.filter(items = ['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [141]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [142]:
# 정규식 
df.filter(regex='b$', axis=1) #regularexpression 정규식

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# row 드롭하기
- row 인덱스로 row를 drop할 수 있습니다.

In [14]:
friend_dict_list = [{'age':20,'job':'student'},
                    {'age':30,'job':'developer'},
                    {'age':25,'job':'teacher'}]

df = pd.DataFrame(friend_dict_list, index=['John','Jenny','Nate'])
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    25    teacher

In [15]:
df.drop(['John','Nate']) # drop된 결과는 데이터프레임에 저장되지 않는다.
                         # 저장하고 싶을 경우, 결과를 데이터프레임에 따로 저장해야 된다.

       age        job
Jenny   30  developer

In [16]:
df = df.drop(['John','Nate'])
df

       age        job
Jenny   30  developer

### drop된 결과를 바로 데이터프레임에 저장하는 방법
- inplace 키워드를 사용하면, 따로 저장할 필요없이 drop된 결과가 데이터프레임에 저장된다.

In [7]:
friend_dict_list = [{'age':20,'job':'student'},
                    {'age':30,'job':'developer'},
                    {'age':25,'job':'teacher'}]

df = pd.DataFrame(friend_dict_list, index=['John','Jenny','Nate'])
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    25    teacher

In [18]:
df.drop(['John','Nate'], inplace=True)
df

       age        job
Jenny   30  developer

In [23]:
# row index로 drop하는 방법
df = df.drop(df.index[[0,2]])
df

       age        job
Jenny   30  developer

### column값으로 row drop하기  / 연산자 사용

In [6]:
df.drop('age', axis = 1)

             job
John     student
Jenny  developer
Nate     teacher

In [14]:
df['salary'] = 0
df

       age        job  salary
John    20    student       0
Jenny   30  developer       0
Nate    25    teacher       0

In [15]:
df=df.drop('salary', axis = 1)
df

       age        job
John    20    student
Jenny   30  developer
Nate    25    teacher

In [17]:
# 넘파이를 이용해서, 한줄에 새로운 컬럼값을 생성
import numpy as np

df['salary'] = np.where(df['job'] != 'student', 'yes','no')
df

       age        job salary
John    20    student     no
Jenny   30  developer    yes
Nate    25    teacher    yes

In [39]:
friend_dict_list = [{'name':'John','midterm':95, 'final':85},
                   {'name':'Jenny','midterm':85, 'final':80},
                   {'name':'Nate','midterm':75, 'final':95},
                    {'name':'Brian','midterm':55, 'final':45}
                   ]

score_df = pd.DataFrame(friend_dict_list,columns = ['name','midterm','final'])
score_df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       75     95
3  Brian       55     45

In [40]:
# 파생 변수
score_df['total'] = score_df['midterm']+score_df['final']
score_df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       75     95    170
3  Brian       55     45    100

In [41]:
# 평균
score_df['average'] = score_df['total']/2
score_df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       75     95    170     85.0
3  Brian       55     45    100     50.0

In [42]:
# 리스트에 조건별 값을 담아서, 새로운 컬럼으로 추가 시킬 수 있다.

grades = []

for row in score_df['average']:
    if row >= 90:
        grades.append('A')
    elif row >=80:
        grades.append('B')    
    elif row >=70:
        grades.append('C')
    elif row >=60:
        grades.append('D')
    else:
        grades.append('F')
        
        
score_df['grade'] = grades
score_df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       75     95    170     85.0     B
3  Brian       55     45    100     50.0     F

### apply()  사용 예제
- 컬럼의 값을 변경하는 코드 구현.

In [43]:
# 값의 수정

def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'
    
score_df.grade = score_df.grade.apply(pass_or_fail)
score_df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       75     95    170     85.0  Pass
3  Brian       55     45    100     50.0  Fail

In [74]:
# 연월일의 정보에서 연도만 추출하는 예제

date_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}]

date_df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
date_df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [75]:
def extract_year(row):
    return row.split('-')[0]

def extract_month(row):
    return row.split('-')[1]

def extract_day(row):
    return row.split('-')[2]

def extract_year2(row):
    return row[0:4]

date_df['year']=date_df['yyyy-mm-dd'].apply(extract_year)
date_df['month']=date_df['yyyy-mm-dd'].apply(extract_month)
date_df['day']=date_df['yyyy-mm-dd'].apply(extract_day)
date_df

   yyyy-mm-dd  year month day
0  2000-06-27  2000    06  27
1  2002-09-24  2002    09  24
2  2005-12-20  2005    12  20

### apply() 파라미터 전달하기

- 키워드 파라미터를 사용하면, apply가 적용된 함수에 파라미터를 전달 할 수 있다.
- 키워드 파라미터의 추가는 제한이 없다.

In [76]:
def extract_year_age(year, current_year):
    return current_year - int(year)

date_df['age'] = date_df['year'].apply(extract_year_age, current_year=2022)
date_df

   yyyy-mm-dd  year month day  age
0  2000-06-27  2000    06  27   22
1  2002-09-24  2002    09  24   20
2  2005-12-20  2005    12  20   17

In [77]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [78]:
date_df['introduce'] =date_df['age'].apply(get_introduce, prefix = 'I am ', suffix = ' years old')
date_df

   yyyy-mm-dd  year month day  age          introduce
0  2000-06-27  2000    06  27   22  I am 22 years old
1  2002-09-24  2002    09  24   20  I am 20 years old
2  2005-12-20  2005    12  20   17  I am 17 years old

In [79]:
# 여러개의 컬럼을 동시에 전달하기
# - axis = 1 이라는 키워드 파라미터를 apply()에 전달해 주면, 모든 컬럼을 지정된 함수에서 사용 가능.

def get_introduce2(row):
    return ' I was born in ' + str(row.year) + ' my age is ' + str(row.age)

date_df.introduce = date_df.apply(get_introduce2, axis=1)
date_df

   yyyy-mm-dd  year month day  age                         introduce
0  2000-06-27  2000    06  27   22   I was born in 2000 my age is 22
1  2002-09-24  2002    09  24   20   I was born in 2002 my age is 20
2  2005-12-20  2005    12  20   17   I was born in 2005 my age is 17

### map()로 컬럼 추가 및 변경하기

In [80]:
# 연월일의 정보에서 연도만 추출하는 예제

date_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}]

date_df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
date_df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [83]:
date_df['year'] = date_df['yyyy-mm-dd'].map(extract_year)
date_df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [85]:
# 파라미터로 딕셔너리를 전달하면 컬럼값을 쉽게 원하는 값으로 변경 가능.
# 기존의 컬럼값은 딕셔너리의 key로 사용되고, 해당되는 value의 값으로 컬럼값이 변경.

job_list=[{'age':20, 'job':'student'},
         {'age':30, 'job':'developer'},
         {'age':35,'job':'teacher'}]

df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   35    teacher

In [87]:
df.job = df.job.map({"student":1, "developer":2, "teacher":3})
df

   age  job
0   20    1
1   30    2
2   35    3

### applymap()메서드
- 데이터프레임 전체의 각각의 값을 한 번에 변경시킬 때 사용하면 유용.

In [91]:
x_y = [{'x':5.5, 'y': -5.6},
       {'x':-5.2, 'y': -5.5},
       {'x':-1.6, 'y': -4.5}]

df = pd.DataFrame(x_y)

In [93]:
df=df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0 -6.0
2 -2.0 -4.0

### 데이터프레임에 row 추가하기

In [94]:
friend_dict_list = [{'name':'jone','midterm':95,'final':85},
                   {'name':'jenny','midterm':85,'final':80},
                   {'name':'Nate','midterm':75,'final':95},
                   {'name':'Brian','midterm':55,'final':45}]
score_df = pd.DataFrame(friend_dict_list, columns = ['name','midterm','final'])
score_df

    name  midterm  final
0   jone       95     85
1  jenny       85     80
2   Nate       75     95
3  Brian       55     45

In [97]:
df2 = pd.DataFrame([['Ben', 50, 50]], columns=['name','midterm','final'])

df2.head()

  name  midterm  final
0  Ben       50     50

In [100]:
score_df.append(df2, ignore_index=True)

    name  midterm  final
0   jone       95     85
1  jenny       85     80
2   Nate       75     95
3  Brian       55     45
4    Ben       50     50

### groupby() 함수
- 데이터에서 정보를 취하기 위해서 그룹별로 묶는 방법.

In [110]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]

df = pd.DataFrame(student_list,columns=['name','major','sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [111]:
groupby_major = df.groupby('major')
groupby_major

In [112]:
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [116]:
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [118]:
# 그룹 객체를 다시 데이터프레임으로 생성.

df_major_cnt = pd.DataFrame({'count': groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [119]:
groupby_sex = df.groupby('sex')
groupby_sex

In [123]:
for name, group in groupby_sex:
    print(name + " : " + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [124]:
df_sex_cnt = pd.DataFrame({'count': groupby_sex.size()}).reset_index()
df_sex_cnt

      sex  count
0  female      6
1    male      5

## 중복 데이터 drop하기

In [125]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]

df = pd.DataFrame(student_list,columns=['name','major','sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [130]:
# 중복 데이터 삽입
df2 = pd.DataFrame([['Zara',"Psychology","female"]], columns=['name','major','sex'])
df2

df = df.append(df2, ignore_index=True)

In [131]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      Zara        Psychology  female

In [132]:
#중복된 데이터 확인하기
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [134]:
# 중복데이터를 삭제
df = df.drop_duplicates()
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [137]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': None, 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': None},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
                {'name': 'Nate', 'major': None, 'sex': "male"}
         ]

df = pd.DataFrame(student_list,columns=['name','major','sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy              None  female
10      Sera        Psychology    None
11      John  Computer Science    None
12      Nate              None    male

In [139]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
dtype: bool

In [145]:
df.duplicated(['name'], keep = False)

0      True
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
dtype: bool

In [142]:
# keep 값을 first 또는 last라고 값을 줘서 중복된 값 중, 어느 값을 살릴지 결정.

df.drop_duplicates(['name'], keep='last') # keep : dafault(fisrt)

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy              None  female
10      Sera        Psychology    None
11      John  Computer Science    None
12      Nate              None    male

# None 처리하기

In [172]:
# Null 또는 NaN 확인하기

friend_dict_list=[{'name':'Jone', 'age':20, 'job':'student'}, 
                  {'name':'Jenny','age':30, 'job':'developer'}, 
                  {'name':'Nate','age':None, 'job':'teacher'},
                  {'name':'Brian','age':12, 'job':'teacher'},
                  {'name':'Yuna','age':20, 'job':'teacher'}
                 ]

df = pd.DataFrame(friend_dict_list)
df.head()

    name   age        job
0   Jone  20.0    student
1  Jenny  30.0  developer
2   Nate   NaN    teacher
3  Brian  12.0    teacher
4   Yuna  20.0    teacher

In [149]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     3 non-null      float64
 2   job     4 non-null      object
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [150]:
df.describe()

             age
count   3.000000
mean   20.666667
std     9.018500
min    12.000000
25%    16.000000
50%    20.000000
75%    25.000000
max    30.000000

In [151]:
df.isna()

    name    age    job
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False

In [152]:
df.isnull()

    name    age    job
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False

## Null 또는 NaN 값 변경.

In [154]:
# Null을 0으로 설정 예제.
tmp = df
tmp['age'] = tmp['age'].fillna(0)
tmp

    name   age        job
0   Jone  20.0    student
1  Jenny  30.0  developer
2   Nate   0.0    teacher
3  Brian  12.0    teacher

In [173]:
# 평균(중위수)을 계산해서 Null 값을 대체.

df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)
df

    name   age        job
0   Jone  20.0    student
1  Jenny  30.0  developer
2   Nate  16.0    teacher
3  Brian  12.0    teacher
4   Yuna  20.0    teacher

## Unique
- 컬럼에 여러 값이 있을 때, 중복없이 어떤 값들이 있는지 확인하는 방법.

In [177]:
job_list = [{'name': 'John', 'job': "teacher"},
            {'name': 'Nate', 'job': "teacher"},
            {'name': 'Fred', 'job': "teacher"},
            {'name': 'Abraham', 'job': "student"},
            {'name': 'Brian', 'job': "student"},
            {'name': 'moc', 'job': "developer"},
            {'name': 'king', 'job': "teacher"},
            {'name': 'bird', 'job': "dentist"},
            {'name': 'Yuna', 'job': "teacher"},
            {'name': 'Rob', 'job': "lawyer"},
            {'name': 'Brian', 'job': "student"},
            {'name': 'Matt', 'job': "student"},
            {'name': 'Wendy', 'job': "banker"},
            {'name': 'Edward', 'job': "teacher"},
            {'name': 'Ian', 'job': "teacher"},
            {'name': 'Chris', 'job': "banker"},
            {'name': 'Philip', 'job': "lawyer"},
            {'name': 'Janny', 'job': "basketball player"},
            {'name': 'Gwen', 'job': "teacher"},
            {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [178]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5       moc          developer
6      king            teacher
7      bird            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [180]:
# 컬럼(시리즈)의 unique() 함수를 사용하여, 중복없이 컬럼에 있는 모든 값들을 출력.

print(df.job.unique())

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

In [181]:
# 각 unique한 값 별로 몇 개의 데이터가 속하는지 value_counts() 함수로 확인.
df.job.value_counts()

teacher              8
student              5
lawyer               2
banker               2
developer            1
dentist              1
basketball player    1
Name: job, dtype: int64

# 두 개의 데이터프레임 합치기

In [183]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "teacher"},
      {'name': 'Fred', 'job': "teacher"}]

l2 = [{'name': 'Abraham', 'job': "student"},
      {'name': 'Brian', 'job': "student"},
      {'name': 'moc', 'job': "developer"}]

df1 = pd.DataFrame(l1, columns=['name','job'])
df2 = pd.DataFrame(l2, columns=['name','job'])

In [184]:
# pd.concat() : 두번째 데이터프레임을 첫번째 데이터프레임의 새로운 row(행) 합침.

frames = [df1, df2]
result = pd.concat(frames, ignore_index=True)
result

      name        job
0     John    teacher
1     Nate    teacher
2     Fred    teacher
3  Abraham    student
4    Brian    student
5      moc  developer

In [186]:
# df.append() : 두번째 데이터프레임을 첫번째 데이터프레임의 새로운 row(행) 합침.
df1.append(df2, ignore_index=True)

      name        job
0     John    teacher
1     Nate    teacher
2     Fred    teacher
3  Abraham    student
4    Brian    student
5      moc  developer

In [187]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

df1 = pd.DataFrame(l1, columns=['name','job'])
df2 = pd.DataFrame(l2, columns=['age','country'])

In [188]:
result = pd.concat([df1, df2], ignore_index=True, axis=1)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

## 두 개의 리스트를 묶어서 데이터프레임으로 생성

In [192]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparision = pd.DataFrame({'label': label,
                          'prediction' : prediction})

comparision

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5